## "Кратные пяти из диапазона"

### Задание

Даны два целые числа a и b.

Выведите на экран все целые **кратные 5** от a до b включительно.

### Формат входных данных

Даны два целые числа. **Не гарантируется**, что a < b. \
Если a > b, то выводим все числа из диапазона [b, a].

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
a = int(input("a: "))
b = int(input("b: "))

a = int(input("a: "))
b = int(input("b: "))

if a > b:
  a = a + b
  b = a - b
  a = a - b
else:
    while a < b + 1:
        if a % 5 == 0:
            print(a)
            a = a + 1
        else:
            a += 1

```
